/** @file

;******************************************************************************
;* Copyright (c) 2023, Insyde Software Corporation. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

//
// Copyright (c) 2004, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   Strings.vfr
//
// Abstract:
//
//   String definitions for BdsPlatform formset.
//
// Revision History:
//
// --*/

/=#

#include "Standard.uni"

//
// These Bvdt data will be updated by GetBvdtInfo function from BvdtLib library.
//
//#include "BiosInfo.uni"
#string STR_H2O_MISC_BIOS_VERSION          #language en-US  "Fake Data"
#string STR_H2O_MISC_SYSTEM_PRODUCT_NAME   #language en-US  "H2O"
#string STR_H2O_CCB_VERSION                #language en-US  "Fake Data"
#string STR_INTERNAL_EFI_SHELL         #language en-US  "[Internal EFI Shell]"
                                       #language fr-FR  "[la Coquille interne de EFI]"
                                       #language zh-TW  "[\wide內部\narrowEFI Shell]"
                                       #language ja-JP  "[\wideインターナル\narrowEFI\wideシェール\narrow]"
                                       #language it-IT  "[Shell EFI Interna]"
                                       #language es-ES  "[Interna EFI Shell]"
                                       #language de-DE  "[Internal EFI-Hülle]"
                                       #language pt-PT  "[Interna EFI Shell]"
                                       
#string STR_LEGACY_BOOT_A              #language en-US  "[Internal Legacy Boot A:]"
                                       #language fr-FR  "[Amorce Legacy interne A:]"
                                       #language zh-TW  "[\wide內部傳統開機\narrowA:]"
                                       #language ja-JP  "[\wideインターナルレガシィブート\narrowA：]"
                                       #language it-IT  "[Legacy boot da A:]"
                                       #language es-ES  "[Interna Legacy Boot A:]"
                                       #language de-DE  "[Internal Erbschaft Aufputsch A:]"
                                       #language pt-PT  "[Interna Legacy Boot A:]"
                                       
#string STR_PROCESSED_ALL_BOOT_OPTIONS #language en-US  "[ProcessedAllBootOptions(): Load shell from the FV]"
                                       #language fr-FR  "[ProcessedAllBootOptions (): shell charge de la FV]"
                                       #language zh-TW  "[ProcessedAllBootOptions (): \wide由\narrowFV\wide載入\narrowShell]"
                                       #language ja-JP  "[\wideプロセスオルブートオプション\narrow()FV\wideからシェールをロードする\narrow]"
                                       #language it-IT  "[ProcessedAllBootOptions(): Carica shell dallo FV]"
                                       #language es-ES  "Procesado todas las opciones de arranques (): cargar capa desde FV"
                                       #language de-DE  "[Prozess. Alle Aufputschoptionen von FV-Aufl]"
                                       #language pt-PT  "[Todos os processados Opções de Inicialização (): carga shell a partir de FV]"
#string STR_DEFAULT_TIMEOUT_BANNER     #language en-US  "Default boot selection will be booted in "
                                       #language fr-FR  "Sélection de démarrage par défaut sera lancée"
                                       #language zh-TW  "\wide預設開機選擇項目將被載入\narrow"
                                       #language ja-JP  "\wideディフォルトブートオプションを起動する\narrow"
                                       #language it-IT  "Il sistema sia avvierà dal boot di default in"
                                       #language es-ES  "Selección de arranque predeterminado será arrancado en"
                                       #language de-DE  "Umlenkung Aufladungsauswahl wird erfolgen"
                                       #language pt-PT  "Seleção de boot de padrão será iniciado em"
                                       
#string STR_SECONDS                    #language en-US  " seconds"
                                       #language fr-FR  " les secondes"
                                       #language zh-TW  " \wide秒\narrow"
                                       #language ja-JP  " \wide秒\narrow"
                                       #language it-IT  " secondi"
                                       #language es-ES  " Segundo"
                                       #language de-DE  " Sekunden"
                                       #language pt-PT  " Segundos"
                                       
#string STR_EXIT_DATA                  #language en-US  "ExitData: "
                                       #language fr-FR  "ExitData: "
                                       #language zh-TW  "\wide離開資料\narrow:"
                                       #language ja-JP  "\wideデータ終了\narrow:"
                                       #language it-IT  "ExitData:"
                                       #language es-ES  "Salida de datos:"
                                       #language de-DE  "Ausgangsdaten:"
                                       #language pt-PT  "Saida de dados:"
                                       
#string STR_LOADING                    #language en-US  "Loading: "
                                       #language fr-FR  "Chargement: "
                                       #language zh-TW  "\wide載入中\narrow:"
                                       #language ja-JP  "\wideローディング\narrow:"
                                       #language it-IT  "Sto caricando:"
                                       #language es-ES  "Cargando:"
                                       #language de-DE  "Aufladung:"
                                       #language pt-PT  "Carregando:"
                                       
#string STR_ENTER_NORMAL_BOOT          #language en-US  "Entering Normal Boot Process..."
                                       #language fr-FR  "Saisie processus de démarrage normal..."
                                       #language zh-TW  "\wide正進入正常開機程序\narrow..."
                                       #language ja-JP  "\wide正常起動プロセスの実行中\narrow..."
                                       #language it-IT  "Avvio sequenza normale di Boot..."
                                       #language es-ES  "Entrando al proceso de arranque normal..."
                                       #language de-DE  "Betreten des Normalaufbauprozesses..."
                                       #language pt-PT  "Entrando ao processo de boot normal..."
                                       
#string STR_BIOS_VERSION_STRING        #language en-US  "InsydeH2O Version"
                                       #language fr-FR  "Version d'InsydeH2O"
                                       #language zh-TW  "\wide系微\narrow EFI \wide版本\narrow"
                                       #language ja-JP  "InsydeH2O\wideバージョン\narrow"
                                       #language it-IT  "Versione InsydeH2O"
                                       #language es-ES  "Versión de InsydeH2O"
                                       #language de-DE  "InsydeH2O-Version"
                                       #language pt-PT  "Versão de Insyde H2O"
                                       
#string STR_CPU_TYPE_STRING            #language en-US  "Processor Type"
                                       #language fr-FR  "Type de Procédure"
                                       #language zh-TW  "\wide處理器\narrow \wide型式\narrow"
                                       #language ja-JP  "\wideプロセッサの種類\narrow"
                                       #language it-IT  "Tipo di processore"
                                       #language es-ES  "Tipo de Procesador"
                                       #language de-DE  "Prozessor-Typ"
                                       #language pt-PT  "Tipo de Processor"		
                                       
#string STR_SYSTEM_MEMORY_SPEED_STRING #language en-US  "System Memory Speed"
                                       #language fr-FR  "Vitesse de Mémoire Système"
                                       #language zh-TW  "\wide系統記憶體速度\narrow"
                                       #language ja-JP  "\wideシステムメモリの速度\narrow"
                                       #language it-IT  "Velocita-ITA` memoria sistema"
                                       #language es-ES  "Velocidad de Memoria de Sistema"
                                       #language de-DE  "Systemspeicher Geschwindigkeit"
                                       #language pt-PT  "Velocidade de Memória de Sistema"
                                       
#string STR_ACPI30_BOOT_STRING         #language en-US  "ACPI Selection"
                                       #language fr-FR  "ACPI Selection"
                                       #language zh-TW  "ACPI\wide選擇\narrow"
                                       #language ja-JP  "ACPI\wideオプション\narrow"
                                       #language it-IT  "Selezione ACPI"
                                       #language es-ES  "Selección de la ACPI"
                                       #language de-DE  "ACPI-Auswahl"
                                       #language pt-PT  "Seleção de ACPI"
                                       
#string STR_ACPI10B_TEXT               #language en-US  "Acpi1.0B"
                                       #language fr-FR  "Acpi1.0B"
                                       #language zh-TW  "Acpi1.0B"
                                       #language ja-JP  "Acpi1.0B"
                                       #language it-IT  "Acpi1.0B"
                                       #language es-ES  "Acpi1.0B"
                                       #language de-DE  "Acpi1.0B"
                                       #language pt-PT  "Acpi1.0B"
                                       
#string STR_ACPI30_TEXT                #language en-US  "Acpi3.0"
                                       #language fr-FR  "Acpi3.0"
                                       #language zh-TW  "Acpi3.0"
                                       #language ja-JP  "Acpi3.0"
                                       #language it-IT  "Acpi3.0"
                                       #language es-ES  "Acpi3.0"
                                       #language de-DE  "Acpi3.0"
                                       #language pt-PT  "Acpi3.0"
                                       
#string STR_PERFORM_MEM_TEST           #language en-US  "Perform memory test (DEL to skip)"
                                       #language fr-FR  "Exécute l'examen de mémoire (DEL pour sauter)"
                                       #language zh-TW  "\wide進行記憶體測試\narrow(\wide按\narrowDEL\wide以略過\narrow)"
                                       #language ja-JP  "\wideメモリテストを実行する\narrow(\wideスキップにする場合、\narrowDEL\wideを押してください\narrow)"
                                       #language it-IT  "Avvio controllo memoria (DEL per interrompere)"
                                       #language es-ES  "Testeo del desempeño de la memoria (DEL para saltar)"
                                       #language de-DE  "Vorführung des Speichertestes DEL überspr"
                                       #language pt-PT  "Faça o teste de memória (DEL para saltar)"
                                       
#string STR_MEMORY_TEST_PERCENT        #language en-US  "% of the system memory tested OK"
                                       #language fr-FR  "% de la mémoire de système essayée D'ACCORD"
                                       #language zh-TW  "%\wide之系統記憶體已測試無誤\narrow"
                                       #language ja-JP  "\wideシステムメモリ\narrow%\wide検査をパスした\narrow"
                                       #language it-IT  "% della memoria di sistema controllata OK"
                                       #language es-ES  "% de la memoria del sistema testeado OK"
                                       #language de-DE  "% des Speichersystems i.O. getestet"
                                       #language pt-PT  "% Da memória do sistema testado OK"
                                       
#string STR_DEL_TO_SKIP_MEM_TEST       #language en-US  "Press DEL key to skip memory test"
                                       #language fr-FR  "Appuie sur DEL sauter examen de mémoire"
                                       #language zh-TW  "\wide按下\narrowDEL\wide鍵以略過記憶體測試\narrow"
                                       #language ja-JP  "DEL\wideキーを押し、メモリテストをスキップする\narrow"
                                       #language it-IT  "Premere DEL per saltare il test della memoria"
                                       #language es-ES  "Pulse tecla DEL para saltar el testeo de la memoria"
                                       #language de-DE  "Drück DEL-Schl. um Speichertest z.überspr"
                                       #language pt-PT  "Pressione tecla DEL para saltar o teste de memória"
                                       
#string STR_MEM_TEST_COMPLETED         #language en-US  " bytes of system memory tested OK"
                                       #language fr-FR  " octets dela mémoire de système essayée D'ACCORD"
                                       #language zh-TW  " \wide系統記憶體位元組測試無誤\narrow"
                                       #language ja-JP  " \wideシステムメモリバイト検査をパスした\narrow"
                                       #language it-IT  " bytes della memoria di sistema testati OK"
                                       #language es-ES  " Bits del testeo de la memoria del sistema OK"
                                       #language de-DE  " Bytes des Systemspeichers getested und i.O"
                                       #language pt-PT  " Bytes de memória do sistema testado OK"
                                       
#string STR_NO_EXT_MEM_FOUND           #language en-US  "Memory resource updated!"
                                       #language fr-FR  "la mémoire Non étendue trouvée!"
                                       #language zh-TW  "\wide記憶體資源已更新\narrow!"
                                       #language ja-JP  "\wideメモリリソース更新\narrow"
                                       #language it-IT  "Risorsa Memoria aggiornata!"
                                       #language es-ES  "Actualización del recurso de la memoria!"
                                       #language de-DE  "Speicherquelle aufdatiert"
                                       #language pt-PT  "Recurso de memória atualizada!"
                                       
#string STR_SYSTEM_MEM_ERROR           #language en-US  "System encounters memory errors"
                                       #language fr-FR  "le Système rencontre les erreurs de mémoire"
                                       #language zh-TW  "\wide系統發生記憶體錯誤\narrow"
                                       #language ja-JP  "\wideシステムにはメモリエラー発生する\narrow"
                                       #language it-IT  "Il Sistema ha incontrato errori di memoria"
                                       #language es-ES  "Sistema encontró error de memoria"
                                       #language de-DE  "System empfängt Speicherfehler"
                                       #language pt-PT  "O sistema encontra erros de memória"
                                       
#string STR_START_BOOT_OPTION          #language en-US  "Start boot option"
                                       #language fr-FR  "l'option de botte de Début"
                                       #language zh-TW  "\wide開始開機選項\narrow"
                                       #language ja-JP  "\wideブートオプションをスタートする\narrow"
                                       #language it-IT  "Opzioni Start boot"
                                       #language es-ES  "Opciones de l inicio de arranque"
                                       #language de-DE  "Beginn Aufbildoption"
                                       #language pt-PT  "Iniciar opção de boot"
                                       
#string STR_RECOVERY_FLASH_MSG         #language en-US  "Press [ESC] Abort Recovery mode and reboot"
                                       #language fr-FR  "Appuyez sur [ESC] pour Abandonner le Mode de Récupération et redémarrer"
                                       #language zh-TW  "\wide按下\narrow[ESC]\wide鍵以中止回復模式並重新開機\narrow"
                                       #language ja-JP  "「ESC」\wideを押し、回復モードを強制終了し\narrow"
                                       #language it-IT  "Premere [ESC] per Uscire dalla modalità Recovery e riavviare"
                                       #language es-ES  "Pulse [ESC] para abortar modo de la recuperación y reiniciar"
                                       #language de-DE  "Drück [ESC] um Rückgewinn abzubrechen"
                                       #language pt-PT  "Pressione a tecla [ESC] para abortar modo de recuperação e reiniciar"
                                       
#string STR_RECOVERY_FLASH_TITLE       #language en-US  "Do you want to recovery ROM part? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language fr-FR  "Voulez-vous récupérer ROM part? (Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language zh-TW  "\wide是否回復快閃記憶體內容\narrow? \wide(警告: 並非所有的作業系統皆可在回復模式下開機)\narrow"
                                       #language ja-JP  "\wideロム部分を回復しますか\narrow? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language it-IT  "Vuoi effettuare il recovery della ROM? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language es-ES  "Quiere recuperar la parte ROM? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language de-DE  "Möchten Sie ROM-Teile rückgewinnen? Caution: Not every OS is bootable in Recovery Mode.)"
                                       #language pt-PT  "Você quer fazer recuperação da parte ROM ? Caution: Not every OS is bootable in Recovery Mode.)"
                                       
#string STR_RECOVERY_FLASH_STATUS      #language en-US  "Flash Status"
                                       #language fr-FR  "Statut Flash"
                                       #language zh-TW  "\wide快閃記憶體狀態\narrow"
                                       #language ja-JP  "\wideフラッシュ状態\narrow"
                                       #language it-IT  "Stato Flash"
                                       #language es-ES  "Estados de la Flash"
                                       #language de-DE  "Aufleuchtstatus"
                                       #language pt-PT  "Status da Flash"
                                       
#string STR_RECOVERY_FLASH_YES         #language en-US  "YES,this choice will flash Rom part."
                                       #language fr-FR  "Oui, ce choix renouvellera Rom part."
                                       #language zh-TW  "\wide是，此選項將更新快閃記憶體內容\narrow"
                                       #language ja-JP  "\wideはい、ロム部分をフラッシュにする\narrow"
                                       #language it-IT  "YES, questa scelta avvia la programmazione della ROM."
                                       #language es-ES  "Si, esta opción se flasheara la parte de Rom."
                                       #language de-DE  "Ja, dieses wird ROM-Teil wählen"
                                       #language pt-PT  "Sim, esta escolha irá piscar a parte de Rom"
                                       
#string STR_RECOVERY_FLASH_NO          #language en-US  "NO, boot to OS now."
                                       #language fr-FR  "NON, démarrez à OS maintenant."
                                       #language zh-TW  "\wide否，現在開機進入作業系統\narrow"
                                       #language ja-JP  "\wideいいえ、今\narrowOS\wideを起動する\narrow"
                                       #language it-IT  "NO, avvia l'OS adesso"
                                       #language es-ES  "No, iniciar sistema operativo ahora."
                                       #language de-DE  "Nein, nun Aufpusch zu OS"
                                       #language pt-PT  "NÃO boot para o OS agora"
                                       
#string STR_RECOVERY_FLASH_REBOOT      #language en-US  "Rebooting !"
                                       #language fr-FR  "Redémarrez!"
                                       #language zh-TW  "\wide重新開機\narrow!"
                                       #language ja-JP  "\wide再起動中\narrow!"
                                       #language it-IT  "Riavvio!"
                                       #language es-ES  "Reiniciar!"
                                       #language de-DE  "Wiederaufpuschen!"
                                       #language pt-PT  "Reiniciando!"
                                   
#string STR_BIOS_BUILD_DATE            #language en-US  "BIOS Build Date"
                                       #language fr-FR  "BIOS Build Date"
                                       #language zh-TW  "BIOS\wide建立日期\narrow"
                                       #language ja-JP  "BIOS\wide作成日\narrow"
                                       #language it-IT  "Data di build del BIOS"
                                       #language es-ES  "Fecha de BIOS Buile"
                                       #language de-DE  "BIOS-Buile-Daten"
                                       #language pt-PT  "Data da BIOS Buile"

#string STR_REMOTE_ASSISTANCE_KEY         #language en-US  "F9"
#string STR_REMOTE_ASSISTANCE_BEFORE_STR  #language en-US  "Press F9 Go to ME Remote Assistance."
#string STR_REMOTE_ASSISTANCE_AFTER_STR   #language en-US  "F9 is pressed. Go to ME Remote Assistance."

#string STR_MEBX_KEY                      #language en-US  "F10"
#string STR_MEBX_BEFORE_STR               #language en-US  "Press F10 go to MEBx"
#string STR_MEBX_AFTER_STR                #language en-US  "F10 is pressed. Go to MEBx."                                       
